# YOLOv12 with P2/P3 Heads Only (Tiny Object Focus)
nc: 80 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO12-turbo backbone (Full Backbone to get deep semantic features)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,  [64, 3, 2]] # 0
  - [-1, 1, Conv,  [128, 3, 2, 1, 2]] # 1
  - [-1, 2, C3k2,  [256, False, 0.25]] # 2 (P2)
  - [-1, 1, Conv,  [256, 3, 2, 1, 4]] # 3 (P3)
  - [-1, 2, C3k2,  [512, False, 0.25]] # 4 (P3 features)
  - [-1, 1, CoordAtt, [512]] # 5 (CA on P3)
  - [-1, 1, Conv,  [512, 3, 2]] # 6 (P4)
  - [-1, 4, A2C2f, [512, True, 4]] # 7 (P4 features)
  - [-1, 1, CoordAtt, [512]] # 8 (CA on P4)
  - [-1, 1, Conv,  [1024, 3, 2]] # 9 (P5)
  - [-1, 4, A2C2f, [1024, True, 1]] # 10 (P5 features)
  - [-1, 1, CoordAtt, [1024]] # 11 (CA on P5)

# Light-weight Neck/Head focused on P2/P3
head:
  # Top-down Path (Bring semantic context from P5 -> P2)
  
  # P5 -> P4
  - [-1, 1, Conv, [512, 1, 1]] # 12 Reduce P5
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 13
  - [[-1, 8], 1, BiFPN_Add2, [512, 512]] # 14 Fuse P5_up + P4 (Layer 8)
  - [-1, 2, A2C2f, [512, False, -1]] # 15 (P4_td)

  # P4 -> P3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 16
  - [[-1, 5], 1, BiFPN_Add2, [512, 512]] # 17 Fuse P4_up + P3 (Layer 5)
  - [-1, 2, A2C2f, [512, False, -1]] # 18 (P3_out) -> ONE OF THE OUTPUTS

  # P3 -> P2
  - [-1, 1, Conv, [256, 1, 1]] # 19 Reduce P3 -> 256
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 20
  - [[-1, 2], 1, BiFPN_Add2, [256, 256]] # 21 Fuse P3_up + P2 (Layer 2)
  - [-1, 2, C3k2, [256, False, 0.25]] # 22 (P2_out) -> ONE OF THE OUTPUTS

  # Bottom-up Path (Only P2 -> P3 needed, no need to go back to P4/P5)
  
  # P2 -> P3
  - [-1, 1, Conv, [256, 3, 2]] # 23 Downsample P2
  - [-1, 1, Conv, [512, 1, 1]] # 24 Project to 512
  - [[-1, 18], 1, BiFPN_Add2, [512, 512]] # 25 Fuse P2_down + P3_out (Layer 18)
  - [-1, 2, A2C2f, [512, False, -1]] # 26 (P3_final) -> FINAL OUTPUT

  # No more up-sampling to P4/P5!
  
  - [[22, 26], 1, Detect, [nc]] # Detect(P2, P3) Only!
