# YOLOv12 with BiFPN
nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv,  [64, 3, 2]] # 0
  - [-1, 1, Conv,  [128, 3, 2, 1, 2]] # 1
  - [-1, 2, C3k2,  [256, False, 0.25]] # 2
  - [-1, 1, Conv,  [256, 3, 2, 1, 4]] # 3
  - [-1, 2, C3k2,  [512, False, 0.25]] # 4 (P3)
  - [-1, 1, Conv,  [512, 3, 2]] # 5
  - [-1, 4, A2C2f, [512, True, 4]] # 6 (P4)
  - [-1, 1, Conv,  [1024, 3, 2]] # 7
  - [-1, 4, A2C2f, [1024, True, 1]] # 8 (P5)

head:
  # Top-down P5 -> P4
  - [-1, 1, Conv, [512, 1, 1]] # 9 Reduce P5 to 512
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 10
  - [[-1, 6], 1, BiFPN_Add2, [512, 512]] # 11 Fuse P5_up + P4 (Layer 6)
  - [-1, 2, A2C2f, [512, False, -1]] # 12 (P4_td)

  # Top-down P4 -> P3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 13
  - [[-1, 4], 1, BiFPN_Add2, [512, 512]] # 14 Fuse P4_up + P3 (Layer 4)
  - [-1, 2, A2C2f, [512, False, -1]] # 15 (P3_out)

  # Bottom-up P3 -> P4
  - [-1, 1, Conv, [512, 3, 2]] # 16
  - [[-1, 12], 1, BiFPN_Add2, [512, 512]] # 17 Fuse P3_down + P4_td (Layer 12)
  - [-1, 2, A2C2f, [512, False, -1]] # 18 (P4_out)

  # Bottom-up P4 -> P5
  - [-1, 1, Conv, [1024, 3, 2]] # 19
  - [[-1, 8], 1, BiFPN_Add2, [1024, 1024]] # 20 Fuse P4_down + P5 (Layer 8)
  - [-1, 2, C3k2, [1024, True]] # 21 (P5_out)

  - [[15, 18, 21], 1, Detect, [nc]] # 22
