# YOLOv12 with CA (Coordinate Attention)
nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv,  [64, 3, 2]] # 0
  - [-1, 1, Conv,  [128, 3, 2, 1, 2]] # 1
  - [-1, 2, C3k2,  [256, False, 0.25]] # 2
  - [-1, 1, Conv,  [256, 3, 2, 1, 4]] # 3
  - [-1, 2, C3k2,  [512, False, 0.25]] # 4 (P3)
  - [-1, 1, CoordAtt, [512]] # 5 (CA on P3)
  - [-1, 1, Conv,  [512, 3, 2]] # 6
  - [-1, 4, A2C2f, [512, True, 4]] # 7 (P4)
  - [-1, 1, CoordAtt, [512]] # 8 (CA on P4)
  - [-1, 1, Conv,  [1024, 3, 2]] # 9
  - [-1, 4, A2C2f, [1024, True, 1]] # 10 (P5)
  - [-1, 1, CoordAtt, [1024]] # 11 (CA on P5)

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 12
  - [[-1, 8], 1, Concat, [1]] # 13 cat backbone P4 (Layer 8)
  - [-1, 2, A2C2f, [512, False, -1]] # 14

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 15
  - [[-1, 5], 1, Concat, [1]] # 16 cat backbone P3 (Layer 5)
  - [-1, 2, A2C2f, [256, False, -1]] # 17 (P3_out)

  - [-1, 1, Conv, [256, 3, 2]] # 18
  - [[-1, 14], 1, Concat, [1]] # 19 cat head P4 (Layer 14)
  - [-1, 2, A2C2f, [512, False, -1]] # 20 (P4_out)

  - [-1, 1, Conv, [512, 3, 2]] # 21
  - [[-1, 11], 1, Concat, [1]] # 22 cat backbone P5 (Layer 11)
  - [-1, 2, C3k2, [1024, True]] # 23 (P5_out)

  - [[17, 20, 23], 1, Detect, [nc]] # 24
